############################
#File Name: 云顶书院寒假实践项目一.py
#Author: yundinger
#Created Time: 2019-01-20 19:34:27
############################

"""
任务背景：

        小明从小到大一直生活在内陆地区，特别想看一次大海，无奈资金不足，希望同学们可以帮帮他，从贴吧里给他找一点图片，让他
        看一看大海的样子。

任务需求：
    1.爬取所给链接中大海的图片
      链接：https://tieba.baidu.com/p/2125145202#!/l/p1
    2.根据图片格式保存成相应的形式（图片.jpg或动图.gif）
    3.保存至自己新建的文件夹中，图片名称为：ocean1.jpg(数字自增)


作业要求：
        1.在21日晚上9：00之前将作业交给副组长，副组长统一打包发给组长
        2.作业格式：创建一个文件夹，命名格式为：姓名_task5,如:小明_task5,将写好的代码的py文件(就是后缀是.py)和保存图片的文
          件夹的截图放到这个文件夹里。将文件夹打包发送。

"""
